.model small
.stack 100h
.286
.data
.code
k1:	mov ax,03h	;считать положения курсора
	int 10h
	mov dh,4	;установка курсора в позицию
	mov dl,25	;  (4:25)
	mov si,256	;количество символов для вывода
	mov al,0
	mov di,0
	mov ah,09h	;функция для вывода символа с заданным атрибутом
	mov cx,1		;определяем кол-во повторений
	mov bl,00011101b	;атрибут символа(101b-цвет символа magenta,001-цвет фона cyan)
k2:	int 10h
	push ax			;размещаем значение регистра в стеке
	mov ah,02h	;установление положения курсора
	inc dl		;перемещаем курсор на 1 столбец влево
	int 10h
	mov ah,09h	;вывод символа
	mov al,20h	;ascii-код пробела записываем в регистр
	int 10h
	mov ah,2
	inc dl
	int 10h
	pop ax	
	inc al	
	inc di
	cmp di,0Fh	;сравниваем значение di с 16
	jne k3		;если не равно, то переходим к метке к3
	push ax		
	mov ah,2
	inc dh	;установление курсора на 1 строку ниже
	mov dl,25	;установление курсора на 25 позицию
	int 10h
	pop ax
	mov di,0
k3:	dec si		;уменьшить на 1
	cmp si,0		;проверяем достигнут ли конец вывода
	jne k2
	mov ah,4ch
	int 21h
	end k1